package day02; // 현재 파일이 위치한 패키지의 이름을 명시

public class Test04 { // 클래스

	public static void main(String[] args) { // 메인메소드
		/*
		 public : 접근지정자 : 완전공개
		 
		 class 	: 클래스 만들때 사용하는 키워드
		 		  	자바는 클래스들로 구성되어있다. 자바의 최소 단위.
		 		  	클래스 바깥에는 코드 작성X (예외 package, import)
		 		  	
		 Test04	: 클래스 이름 : 첫글자 대문자로 만들기 (변수와 구분)
		 		  	> 이클립스에서 파일생성시 Name에 이름작성하면
		 		  	이것이 클래스의 이름이 되고, 파일생성시 첫글자 대문자로 작성
		 		  클래스 명명규칙 : 첫글자 대문자, 띄어쓰기X , 한글 ,
		 		  	특수기호 _ $ 만 허용, 키워드X, 대소문자 구분 (Num != num)
		 		  	패키지 안에서는 같은이름의 클래스가 있을 수 없다.
		 		  	
		 static	: 전역 키워드 : 나중
		 
		 void	: 리턴타입 중 하나로 리턴할 값 없다. 
		 
		 main	: 메소드 이름 : 메인메소드는 프로그램이 시작되면 (ctrl+F11)
		 						가장먼저 자동으로 실행되는 메소드.
		 						메인메소드 종료시 프로그램도 종료
		 						프로그램내에 반드시 하나만 존재해야함.
		 
		 (String[] args) : 매개변수 : 나중
		 
		 
		 
		 
		 
		 
		 
		 
		 	 
		*/
		
		
		
		
		
	}

}
